Revit 2015 API
BoundarySegmentArrayArray.Item Property
Gets or sets a boundary segment array at a specified index within the array.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual BoundarySegmentArray this[
	int index
] { get; set; }
Visual Basic
Public Overridable Property Item ( _
	index As Integer _
) As BoundarySegmentArray
	Get
	Set
Visual C++
public:
virtual property BoundarySegmentArray^ Item[int index] {
	BoundarySegmentArray^ get (int index);
	void set (int index, BoundarySegmentArray^ value);
}
Parameters
index
Type: System.Int32
The index of the boundary segment array to be set or retrieved.
Return Value
Returns the boundary segment array at the specified index.
See Also
BoundarySegmentArrayArray Class
Autodesk.Revit.DB.Architecture Namespace